Revit 2024 API
FamilyParameterSet.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	FamilyParameter item
)
Visual Basic
Public Overridable Function Insert ( _
	item As FamilyParameter _
) As Boolean
Visual C++
public:
virtual bool Insert(
	FamilyParameter^ item
)
Parameters
item
Type: Autodesk.Revit.DB.FamilyParameter
See Also
FamilyParameterSet Class
Autodesk.Revit.DB Namespace